In [4]:
from tkinter import *  
parent = Tk()  
img = PhotoImage(file='tenor.gif')
redbutton = Button(parent, text = "Red", fg = "red")  
redbutton.pack( side = LEFT)  
greenbutton = Button(parent, text = "Black", fg = "black")  
greenbutton.pack( side = RIGHT )  
bluebutton = Button(parent, text = "Blue", fg = "blue")  
bluebutton.pack( side = TOP )  
blackbutton = Button(parent, text = "Green", fg = 'green')  
blackbutton.pack( side = BOTTOM)  
parent.mainloop()

crawling-> SQL(mariaDB) -> Dataframe -> Analysis ->visualization

class 다음
    
    아시아
    
    조선
    
    중앙
    
    동아

# PANDAS Documentation

install command

In [5]:
!pip install pandas

Collecting pandas
  Downloading pandas-1.1.0-cp38-cp38-win32.whl (8.2 MB)
Requirement already satisfied: python-dateutil>=2.7.3 in c:\users\asiae_06\appdata\local\programs\python\python38-32\lib\site-packages (from pandas) (2.8.1)
Collecting pytz>=2017.2
  Downloading pytz-2020.1-py2.py3-none-any.whl (510 kB)
Collecting numpy>=1.15.4
  Downloading numpy-1.19.1-cp38-cp38-win32.whl (10.9 MB)
Requirement already satisfied: six>=1.5 in c:\users\asiae_06\appdata\local\programs\python\python38-32\lib\site-packages (from python-dateutil>=2.7.3->pandas) (1.15.0)
Installing collected packages: pytz, numpy, pandas
Successfully installed numpy-1.19.1 pandas-1.1.0 pytz-2020.1

In [23]:
import pandas as pd

In [24]:
seq_data = [10,20,30,40,50]
s1=pd.Series(seq_data)
s1

0    10
1    20
2    30
3    40
4    50
dtype: int64

In [25]:
s1.index

RangeIndex(start=0, stop=5, step=1)

In [26]:
s1.values#dictionary type

array([10, 20, 30, 40, 50], dtype=int64)

In [27]:
s2=pd.Series(['a','b','c',1,2,3,])
s2

0    a
1    b
2    c
3    1
4    2
5    3
dtype: object

In [28]:
import numpy as np#numpy는 내장 되어있다

In [29]:
s3=pd.Series([np.nan,10,30]) #Nan -> null
s3

0     NaN
1    10.0
2    30.0
dtype: float64

In [30]:
s4=pd.Series(seq_data)
s4

0    10
1    20
2    30
3    40
4    50
dtype: int64

In [34]:
index_date = ['2018-10-07','2018-10-08','2018-10-09','2018-10-10']
#s4 =pd.Series(seq_data)
s4 =pd.Series([200,195,np.nan,205], index = index_date)  # 
s4

2018-10-07    200.0
2018-10-08    195.0
2018-10-09      NaN
2018-10-10    205.0
dtype: float64

In [37]:
s5=pd.Series({'국어':100,'영어':95, '수학':90})
s5

국어    100
영어     95
수학     90
dtype: int64

In [47]:
pd.date_range(start='2019-01-01', end='2019-10-07', freq = 'D')

DatetimeIndex(['2019-01-01', '2019-01-02', '2019-01-03', '2019-01-04',
               '2019-01-05', '2019-01-06', '2019-01-07', '2019-01-08',
               '2019-01-09', '2019-01-10',
               ...
               '2019-09-28', '2019-09-29', '2019-09-30', '2019-10-01',
               '2019-10-02', '2019-10-03', '2019-10-04', '2019-10-05',
               '2019-10-06', '2019-10-07'],
              dtype='datetime64[ns]', length=280, freq='D')

In [43]:
pd.date_range(start = '2019-01-01', periods =7)

DatetimeIndex(['2019-01-01', '2019-01-02', '2019-01-03', '2019-01-04',
               '2019-01-05', '2019-01-06', '2019-01-07'],
              dtype='datetime64[ns]', freq='D')

# DATA FRAME p.247

In [51]:
df = pd.DataFrame([[1,2,3],[4,5,6],[7,8,9]])
df

   0  1  2
0  1  2  3
1  4  5  6
2  7  8  9

In [72]:
data = np.array([[1,2,3],[4,5,6],[7,8,9],[10,11,12]])
index_date =pd.date_range(start='2019-01-01', periods= 4)
columns_list = ['A', 'B', 'C']
pd.DataFrame(data, index=index_date, columns = columns_list)

             A   B   C
2019-01-01   1   2   3
2019-01-02   4   5   6
2019-01-03   7   8   9
2019-01-04  10  11  12

In [74]:
dp.index

NameError: name 'dp' is not defined

Error Shape of passed values is (4,3) not (3,4)

# p.250

In [69]:
df1 = pd.DataFrame({'연도':[2011,2012,2013,2014],'profit':[5000,2021,12020,1111]})
df1

     연도  profit
0  2011    5000
1  2012    2021
2  2013   12020
3  2014    1111

In [68]:
df2 = pd.Series({'연도':[2011,2012,2013,2014] })
df2

연도         [2011, 2012, 2013, 2014]
profit    [5000, 2021, 12020, 1111]
dtype: object

In [76]:
s1= pd.Series([1,2,3,4,5])
s2= pd.Series([10,20,30,40])
s1-s2

0    -9.0
1   -18.0
2   -27.0
3   -36.0
4     NaN
dtype: float64

In [87]:
df1= pd.DataFrame({'A':[1,2,3,4,5],'B':[10,20,30,40,50],})
df2= pd.DataFrame({'A':[10,20,30,40,50],'B':[100,200,300,400,500]})
df1+df2

    A    B
0  11  110
1  22  220
2  33  330
3  44  440
4  55  550

In [88]:
df3 =df1+df2
df3

    A    B
0  11  110
1  22  220
2  33  330
3  44  440
4  55  550

In [92]:
df3.std()

A     17.392527
B    173.925271
dtype: float64

In [85]:
df1= pd.DataFrame({'A':[1,2,3,4,5],'B':[10,20,30,40,50],'C':[100,200,300,400,500]})
df1

   A   B    C
0  1  10  100
1  2  20  200
2  3  30  300
3  4  40  400
4  5  50  500

In [98]:
df3.mean()
df3.mean(axis=0)
#axis=0 X-Axis Column
#axis=1 Y-axis Index
#axis=2 z-axis

A     33.0
B    330.0
dtype: float64

In [99]:
df3.describe()

               A           B
count   5.000000    5.000000
mean   33.000000  330.000000
std    17.392527  173.925271
min    11.000000  110.000000
25%    22.000000  220.000000
50%    33.000000  330.000000
75%    44.000000  440.000000
max    55.000000  550.000000

# p.258

In [103]:
df1= pd.DataFrame({'A':[1,2,3,4,5,6],'B':[10,20,30,40,50,60],'C':[100,200,300,400,500,600]})
df1.head()

   A   B    C
0  1  10  100
1  2  20  200
2  3  30  300
3  4  40  400
4  5  50  500

In [104]:
df1.tail()

   A   B    C
1  2  20  200
2  3  30  300
3  4  40  400
4  5  50  500
5  6  60  600

In [110]:
df1[-4:-2]

   A   B    C
2  3  30  300
3  4  40  400

In [124]:
ktx_data={'경부선':[3900,3800,3700,3600,3500],
            '호남선':[2900,2800,2700,2600,2500]}

In [125]:
df_ktx = pd.DataFrame(ktx_data, columns = ['경부선', '호남선'], index = ['2011','2012','2013','2014','2015'])
df_ktx

       경부선   호남선
2011  3900  2900
2012  3800  2800
2013  3700  2700
2014  3600  2600
2015  3500  2500

In [130]:
df_ktx.loc["2011"] #key 값으로 찾는것임 loc은 변수가 아닌 함수 형식(property type)

경부선    3900
호남선    2900
Name: 2011, dtype: int64

In [129]:
df_ktx.loc["2011":"2014"]

       경부선   호남선
2011  3900  2900
2012  3800  2800
2013  3700  2700
2014  3600  2600

In [131]:
df_ktx.mean(axis=0)

경부선    3700.0
호남선    2700.0
dtype: float64

In [132]:
df_ktx.mean(axis=1)

2011    3400.0
2012    3300.0
2013    3200.0
2014    3100.0
2015    3000.0
dtype: float64